---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.FlexPipeType
source: html/89da057e-f826-1f1e-dd71-9df4ce7f38cf.htm
---
# Autodesk.Revit.DB.Plumbing.FlexPipeType

A flex pipe type in the Autodesk Revit MEP product.

## Syntax (C#)
```csharp
public class FlexPipeType : MEPCurveType
```

## Remarks
The flex pipe type is only available in the Autodesk Revit MEP product.